/*
Note for the Localization Engineer:
The strings enclosed within < > should NOT be localized. Eg : <OPERATION>
*/

/* Recovery options for the errors */
TryAgainButtonTitle = "Повторить";
CancelButtonTitle = "Отмена";


/*Error descriptions for corrupted store*/
CorruptedEventStoreDescription = "<OPERATION>, так как невозможно прочитать следующий файл: \"/Users/Shared/HP/HP Event Store/HPEventStore.hpstore\".";

/*Error descriptions for missing store*/
MissingEventStoreDescription = "<OPERATION>, так как не удалось найти следующий файл: \"/Users/Shared/HP/HP Event Store/HPEventStore.hpstore\".";

/*Recovery suggestion for corrupted and missing store.*/
MissingEventStoreRecoverySuggesstion = "Замените файл HPEventStore.hpstore, если он перемещен или удален, после чего выберите пункт \"Повторить\".\rЧтобы создать новый файл, нажмите кнопку \"Создать\".";

/* Recovery options for corrupted and missing store */
CreateButtonTitle = "Создать";

/*Error descriptions for permission error*/
EventStorePermissionsErrorDescription = "<OPERATION>, так как приложению не удалось получить доступ к следующему файлу: \"/Users/Shared/HP/HP Event Store/HPEventStore.hpstore\".";

/* Recovery options for corrupted and missing store */
RepairAccessButtonTitle = "Восстановить доступ";

/*Added new key to refer error recovery suggestion if the permission is not proper.*/
EventStorePermissionsErrorRecoverySuggesstion = "Проверьте папки в иерархии файла HPEventStore.hpstore, чтобы убедиться в том, что они не заблокированы и имеют разрешения на \"Чтение и запись\", после чего выберите пункт \"Повторить\".\rЧтобы приложение попыталось исправить разрешения, выберите \"Восстановить доступ\".";

//Error description for out of disk space error
DiskFullErrorDescription = "<OPERATION>, так как на загрузочном диске недостаточно места.";

//Recover suggestion for out of disk space error
DiskFullErrorRecoverySuggesstion = "Удалите часть файлов с диска и выберите пункт \"Повторить\".";
